# Books ERD

![png](Data/books_ERD.png)

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
import json
with open('/Users/Lovei/.secret/mysql.json')as f:
    login = json.load(f)
    
login.keys()

dict_keys(['username', 'password'])

In [3]:
connection  = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/books"
engine = create_engine(connection)
conn = engine.connect()

In [4]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [5]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Inserting Data

### Authors

In [6]:
authors = pd.read_csv('Data/authors.csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [7]:
q = '''DESCRIBE authors;'''
describe_a = pd.read_sql(q, conn)
describe_a

       Field         Type Null  Key Default           Extra
0         id          int   NO  PRI    None  auto_increment
1  full_name  varchar(45)  YES         None

In [8]:
describe_a['Field'].values

array(['id', 'full_name'], dtype=object)

In [9]:
authors.columns

Index(['id', 'author_name'], dtype='object')

In [10]:
rename_auth = {'author_name':'full_name'}
authors = authors.rename(rename_auth, axis=1)
authors.head()

   id          full_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [11]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     1

In [12]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [13]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,conn)

   @@FOREIGN_KEY_CHECKS
0                     0

In [14]:
# Inserting the data now that foreign key checks are disabled
authors.to_sql("authors",conn,index=False, if_exists='append')

5

In [15]:
# confirm the data has been added
q = """SELECT * FROM authors;"""
pd.read_sql(q,conn)

   id          full_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

### Books

In [16]:
books = pd.read_csv('Data/books.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [17]:
q = '''DESCRIBE books;'''
describe_b = pd.read_sql(q, conn)
describe_b

        Field         Type Null  Key Default           Extra
0          id          int   NO  PRI    None  auto_increment
1       title  varchar(45)  YES         None
2  authors_id          int   NO  PRI    None

In [18]:
describe_b['Field'].values

array(['id', 'title', 'authors_id'], dtype=object)

In [19]:
books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [20]:
rename_b = {'author_id':'authors_id'}
books = books.rename(rename_b, axis=1)
books.head()

   id                 title  authors_id
0   1           The Shining           1
1   2                    It           1
2   3      The Great Gatsby           2
3   4  The Call of the Wild           3
4   5   Pride and Prejudice           4

In [21]:
# Inserting the data
books.to_sql("books",conn,index=False, if_exists='append')

6

In [22]:
# confirm the data has been added
q = """SELECT * FROM books;"""
pd.read_sql(q,conn)

   id                 title  authors_id
0   1           The Shining           1
1   2                    It           1
2   3      The Great Gatsby           2
3   4  The Call of the Wild           3
4   5   Pride and Prejudice           4
5   6          Frankenstein           5

### Favorites

In [23]:
favorites = pd.read_csv('Data/favorites.csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [24]:
q = '''DESCRIBE favorites;'''
describe_f = pd.read_sql(q, conn)
describe_f

      Field Type Null  Key Default Extra
0  users_id  int   NO  MUL    None
1  books_id  int   NO  MUL    None

In [25]:
describe_f['Field'].values

array(['users_id', 'books_id'], dtype=object)

In [26]:
favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [27]:
rename_f = {'user_id':'users_id',
           'book_id':'books_id'}
favorites = favorites.rename(rename_f, axis=1)
favorites.head()

   users_id  books_id
0         1         1
1         1         2
2         1         3
3         2         4
4         2         5

In [28]:
# Inserting the data
favorites.to_sql("favorites",conn,index=False, if_exists='append')

7

In [29]:
# confirm the data has been added
q = """SELECT * FROM favorites;"""
pd.read_sql(q,conn)

   users_id  books_id
0         1         1
1         1         2
2         1         3
3         2         4
4         2         5
5         3         5
6         3         6

### Users

In [30]:
users = pd.read_csv('Data/users.csv')
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [31]:
q = '''DESCRIBE users;'''
describe_u = pd.read_sql(q, conn)
describe_u

        Field         Type Null  Key Default           Extra
0          id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [32]:
describe_u['Field'].values

array(['id', 'first_name', 'last_name', 'email'], dtype=object)

In [33]:
users.columns

Index(['id', 'first_name', 'last_name', 'email'], dtype='object')

In [34]:
# Inserting the data
users.to_sql("users",conn,index=False, if_exists='append')

3

In [35]:
# confirm the data has been added
q = """SELECT * FROM users;"""
pd.read_sql(q,conn)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [36]:
# test query
q = """SELECT books.title, favorites.users_id
    FROM books
    JOIN favorites ON books.id = favorites.books_id
    WHERE favorites.users_id =
        (SELECT users.id FROM users WHERE (users.last_name = 'Doe'AND users.first_name = 'John'));"""
pd.read_sql(q,conn)

              title  users_id
0       The Shining         1
1                It         1
2  The Great Gatsby         1